Ran Plan for 2 projects:

1. project: `unifi` dir: `terraform/unifi` workspace: `default`
1. project: `cloudflare` dir: `terraform/cloudflare` workspace: `default`

### 1. project: `unifi` dir: `terraform/unifi` workspace: `default`
```diff
Assuming Role: arn:aws:iam::847713735871:role/atlantis


No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p unifi`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.marcyoung.us/lock?id=myoung34%252Fhomelab%252Fterraform%252Funifi%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p unifi`

---
### 2. project: `cloudflare` dir: `terraform/cloudflare` workspace: `default`
<details><summary>Show Output</summary>

```diff
Assuming Role: arn:aws:iam::847713735871:role/atlantis


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # cloudflare_record.driveway-switch will be created
+ resource "cloudflare_record" "driveway-switch" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "driveway-switch.iot.marcyoung.us"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = "192.168.4.120"
      + zone_id         = "3c96b93095b8117340b6250badf8b44c"
    }

  # cloudflare_record.ecobee will be created
+ resource "cloudflare_record" "ecobee" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ecobee.iot.marcyoung.us"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = "192.168.4.105"
      + zone_id         = "3c96b93095b8117340b6250badf8b44c"
    }

  # cloudflare_record.front-porch-switch will be created
+ resource "cloudflare_record" "front-porch-switch" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "front-porch-switch.iot.marcyoung.us"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = "192.168.4.103"
      + zone_id         = "3c96b93095b8117340b6250badf8b44c"
    }

  # cloudflare_record.garage-switch will be created
+ resource "cloudflare_record" "garage-switch" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "garage-switch.iot.marcyoung.us"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = "192.168.4.101"
      + zone_id         = "3c96b93095b8117340b6250badf8b44c"
    }

  # cloudflare_record.liam-room-starlights will be created
+ resource "cloudflare_record" "liam-room-starlights" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "liam-room-starlights.iot.marcyoung.us"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = "192.168.4.104"
      + zone_id         = "3c96b93095b8117340b6250badf8b44c"
    }

  # cloudflare_record.liamplug will be created
+ resource "cloudflare_record" "liamplug" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "liamplug.iot.marcyoung.us"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = "192.168.4.112"
      + zone_id         = "3c96b93095b8117340b6250badf8b44c"
    }

  # cloudflare_record.pergola-lights will be created
+ resource "cloudflare_record" "pergola-lights" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pergola-lights.iot.marcyoung.us"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = "192.168.4.100"
      + zone_id         = "3c96b93095b8117340b6250badf8b44c"
    }

  # cloudflare_record.plaato-airlock will be created
+ resource "cloudflare_record" "plaato-airlock" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "plaato-airlock.iot.marcyoung.us"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = "192.168.4.111"
      + zone_id         = "3c96b93095b8117340b6250badf8b44c"
    }

  # cloudflare_record.plaato-keg will be created
+ resource "cloudflare_record" "plaato-keg" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "plaato-keg.iot.marcyoung.us"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = "192.168.4.110"
      + zone_id         = "3c96b93095b8117340b6250badf8b44c"
    }

  # cloudflare_record.plug1 will be created
+ resource "cloudflare_record" "plug1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "plug1.iot.marcyoung.us"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = "192.168.4.113"
      + zone_id         = "3c96b93095b8117340b6250badf8b44c"
    }

  # cloudflare_record.plug2 will be created
+ resource "cloudflare_record" "plug2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "plug2.iot.marcyoung.us"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = "192.168.4.107"
      + zone_id         = "3c96b93095b8117340b6250badf8b44c"
    }

  # cloudflare_record.traeger-pellet will be created
+ resource "cloudflare_record" "traeger-pellet" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "traeger-pellet.iot.marcyoung.us"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = "192.168.4.106"
      + zone_id         = "3c96b93095b8117340b6250badf8b44c"
    }

  # cloudflare_record.tubeszb-upstairs will be created
+ resource "cloudflare_record" "tubeszb-upstairs" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tubeszb-upstairs.iot.marcyoung.us"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = "192.168.4.108"
      + zone_id         = "3c96b93095b8117340b6250badf8b44c"
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p cloudflare`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.marcyoung.us/lock?id=myoung34%252Fhomelab%252Fterraform%252Fcloudflare%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p cloudflare`
</details>
Plan: 13 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`